/*=========================================================================
    Date : 2022/01/30(日)	Keyboard.h
        Author : がむしるぉ
        Update :
=========================================================================*/
#ifndef KEYBOARD_H_
#define KEYBOARD_H_

#include <Windows.h>

class Keyboard
{
public:
    static void Update();

public:
    /*******************************************************************************************
        @ brief キー入力を行う(Press)
        @ param
            KeyCode : VK_〇〇という仮想コードを引数にする
    *******************************************************************************************/
    static bool GetKeyPress(int KeyCode);

    /*******************************************************************************************
        @ brief キー入力を行う(Trigger)
        @ param
            KeyCode : VK_〇〇という仮想コードを引数にする
    *******************************************************************************************/
    static bool GetKeyTrigger(int KeyCode);

    /*******************************************************************************************
        @ brief キー入力を行う(Release)
        @ param
            KeyCode : VK_〇〇という仮想コードを引数にする
    *******************************************************************************************/
    static bool GetKeyRelease(int KeyCode);

private:
    static BYTE         m_CurrentState[256];
    static BYTE         m_LastState[256];
};

#endif // !KEYBOARD_H_
