/*=========================================================================
    Date : 2022/02/03(木)	Keyboard.cpp
        Author : がむしるぉ
        Update :
=========================================================================*/
#include "Keyboard.h"

BYTE        Keyboard::m_CurrentState[256];
BYTE        Keyboard::m_LastState[256];


/*=============================================================================================
    キー入力の更新処理
=============================================================================================*/
void Keyboard::Update()
{
    memcpy(&m_LastState, m_CurrentState, sizeof(BYTE) * 256);
    ::GetKeyboardState(m_CurrentState);
}

/*=============================================================================================
    キーが押されているか(Press)
=============================================================================================*/
bool Keyboard::GetKeyPress(int KeyCode)
{
    if ((m_CurrentState[KeyCode] & 0x80))
    {
        return true;
    }
    return false;
}

/*=============================================================================================
    キーが押されているか(Trigger)
=============================================================================================*/
bool Keyboard::GetKeyTrigger(int KeyCode)
{
    if ((m_CurrentState[KeyCode] & 0x80))
    {
        if (!(m_LastState[KeyCode] & 0x80))
        {
            return true;
        }
    }
    return false;
}

/*=============================================================================================
    キーが押されているか(Release)
=============================================================================================*/
bool Keyboard::GetKeyRelease(int KeyCode)
{
    if (!(m_CurrentState[KeyCode] & 0x80))
    {
        if ((m_LastState[KeyCode] & 0x80))
        {
            return true;
        }
    }
    return false;
}